projects/rarefied-flows/impingment/sims/templates/compressible/rhoPimpleAdiabaticFoam/rutlandVortex2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh
runApplication -s preProcess $(getApplication) -postProcess -dict system/preProcess
runApplication decomposePar
runParallel $(getApplication)

#------------------------------------------------------------------------------
